iIF_periodicChannel/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2112                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

10
(
    bottomWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          512;
        startFace       23296;
    }
    topWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          512;
        startFace       23808;
    }
    sides1_half0
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          256;
        startFace       24320;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  sides1_half1;
    }
    sides1_half1
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          256;
        startFace       24576;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  sides1_half0;
    }
    sides2_half0
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          256;
        startFace       24832;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  sides2_half1;
    }
    sides2_half1
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          256;
        startFace       25088;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  sides2_half0;
    }
    inout1_half0
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          128;
        startFace       25344;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  inout1_half1;
    }
    inout1_half1
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          128;
        startFace       25472;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  inout1_half0;
    }
    inout2_half0
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          128;
        startFace       25600;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  inout2_half1;
    }
    inout2_half1
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          128;
        startFace       25728;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  inout2_half0;
    }
)

// ************************************************************************* //
